Autodesk.Revit.DB.IATFTranslationServer.Translate(Autodesk.Revit.DB.ATFTranslationServiceData)
Translate a model according to translationData settings
Returns:
Returns true if the translation finished successfully, false otherwise.
Since:
2021

Autodesk.Revit.DB.IATFTranslationServer
Interface class for external servers implementing ATF translation.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.
Since:
2021